[
  {
    "name": "Domestic Cables",
    "image": "dmstic.jpeg",
    "description": "Reliable wiring solutions for homes and buildings.",
"details": "Are you looking for a safe, reliable, and high-performance electrical wiring solution? Discover the growing demand for BYA FR (Flame Retardant) Type Electric Cables — specially designed to reduce fire hazards and ensure long-term durability.\n\nWhether you're a homeowner, an electrical contractor, a supplier, or a business owner in construction or manufacturing, BYA FR cables offer the safety and efficiency your project needs.\n\nWhy BYA FR Cables?\n\nFlame retardant insulation for enhanced fire safety\n\nIdeal for residential, commercial, and industrial wiring\n\nHigh resistance to heat, chemicals, and mechanical stress\n\nIncreasing demand in real estate, infrastructure, and energy sectors\n\nTrusted by top builders and government projects\n\nAs demand rises for safer electrical systems, now is the time for suppliers and businesses to stock and promote BYA FR cables. Stay ahead of market trends, meet regulatory standards, and offer your clients a trusted solution.\n\nGet connected with BYA FR cables – where safety meets performance."
  },
  {
    "name": "Power Cables",
    "image": "pow c.jpeg",
    "description": "High-performance cables for power distribution.",
"details": "Power Up with Confidence – Choose NYY Cables from LRB Cables\n\nLooking for a reliable solution for mills, factories, heavy industries, or government projects? Our NYY Type Electric Power Cables are built for high-performance, long-term use in demanding environments.\n\nAt LRB Cables, we don’t just deliver cables — we deliver trust.\n\nWhy Choose LRB NYY Cables?\n\n100% Pure Copper for maximum conductivity\n\nAssured copper quality and purity\n\nStrong insulation for safe and durable connections\n\nIdeal for underground installations, power networks, and heavy-load areas\n\nCompliant with government and industrial safety standards\n\nFrom energy plants to factories, trust the name that stands for Love, Respect & Brotherhood — LRB Cables.\n\nQuality that connects. Power that protects."
  },
  {
    "name": "Control Cables",
    "image": "Control.jpeg",
    "description": "Designed for automation, control, and signal transmission.",
"details": "LRB Control Cables – Precision, Safety, and Performance You Can Trust\n\nWhen it comes to controlling machines, systems, and automation, reliable connectivity is critical. LRB Cables manufactures high-quality FR Type Multicore Control Cables designed to ensure accurate signal transmission and safe machinery control.\n\nOur control cables are built for industrial environments, offering superior performance where it matters most.\n\nWhy Choose LRB Control Cables?\n\nFlame Retardant (FR) insulation for enhanced safety\n\nMulticore design for organized and efficient wiring\n\nEnsures accurate control and monitoring of electrical equipment\n\nIdeal for machinery, automation, and control panels\n\nDelivers stable connectivity even under tough conditions\n\nAt LRB Cables, we deliver more than trust — we deliver control with confidence.\n\nLRB Cables – Engineered for Safety. Designed for Control."
  },
  {
    "name": "Submersible Cables",
    "image": "Sub.jpeg",
    "description": "Waterproof cables ideal for deep installations.",
"details": "LRB Submersible Cables - Powering Irrigation, Securing Water Supply\n\nIn agriculture and irrigation, a strong, water-safe connection is everything. That's why LRB Cables proudly offers FR Type Submersible Cables, specially designed for submersible motor installations.\n\nWhether it's for deep tube wells, irrigation schemes, or rural water supply systems - LRB Submersible Cables ensure safe, durable, and efficient performance even in wet and submerged conditions.\n\nWhy Choose LRB Submersible Cables?\n\nFlame Retardant (FR) insulation for extra safety\n\nHigh-quality copper for better conductivity and durability\n\nSpecially built for deep water motor applications\n\nSupports the expansion of irrigation infrastructure and agriculture growth\n\nEnsures continuous water supply with reliable submersible motor operation\n\nFrom the ground to the field - LRB Cables keeps your water flowing and your crops growing.\n\nLRB Cables - Strong Connections for a Greener Future."
  },
  {
    "name": "Communication Cables",
    "image": "commu.jpg",
    "description": "Reliable cables for telecommunication networks.",
"details": "LRB Communication Cables – Clear Signals, Strong Connections\n\nIn today’s connected world, clear communication and reliable control are essential. LRB Cables manufactures high-quality Communication Cables designed to ensure seamless data transfer and secure connections for a wide range of electronic devices and control systems.\n\nWhy LRB Communication Cables?\n\nEngineered for stable signal transmission\n\nIdeal for control panels, electronics, telecom, and automation systems\n\nReduces interference for clean, uninterrupted communication\n\nManufactured with high-quality copper and durable insulation\n\nEnsures long-lasting, safe connectivity across all environments\n\nFrom industrial automation to everyday electronics — LRB Communication Cables keep your world connected.\n\nLRB Cables – More Than Trust, It's Reliable Communication."
  },
  {
    "name": "DC Cables",
    "image": "dc c.jpeg",
    "description": "High-efficiency cables for DC systems and solar panels.",
"details": "Powering the Future with LRB DC Cables Safe, Strong, and Solar-Ready. As Bangladesh moves toward a cleaner, greener future, solar energy is lighting up even the most remote corners of the country. At LRB Cables, we provide gh-quality DC Cables specially designed for solar systems — ensuring safe, reliable, and long-lasting connections. Why LRB DC Cables?\n\nBuilt to handle solar energy transmission with minimal loss\n\nDesigned for safe connections in rural and urban solar installations\n\nResistant to heat, UV, and harsh environments\n\nSolves connectivity challenges in off-grid and remote areas\n\nSupports the national goal to reduce electricity congestion and promote clean energy\n\nFrom rooftops to rural homes, LRB DC Cables are helping enlighten all of Bangladesh with sustainable power.\n\nLRB Cables – Lighting the Nation with Solar Connection & Safety."
  },
  {
    "name": "Special Customised Cables",
    "image": "custom.jpeg",
    "description": "Tailor-made cables for specialized applications.",
"details": "LRB Customized Cables – Tailored Power Solutions, Built for Your Needs\n\nEvery project is unique — and so are your cable requirements. That’s why LRB Cables offers Special Customized Cables, specially designed to meet the specific needs of users, suppliers, and businesses.\n\nFrom NYY Type Power Cables to other specialized variants, we customize as per your technical specifications and application demands, while strictly maintaining our premium quality standards.\n\nWhy Choose LRB Customized Cables?\n\nCustomized to meet project-specific needs\n\nAvailable in various sizes, cores, insulation types, and lengths\n\nEnsured copper purity and high conductivity\n\nStrict quality control for safe and long-lasting performance\n\nIdeal for industrial, commercial, and government projects\n\nAt LRB Cables, we turn your requirements into reliable solutions — with quality you can trust.\n\nLRB Cables – Your Demand, Our Commitment. More Than Trust."
  },
  {
    "name": "Overhead Related Cables",
    "image": "Overhead.jpeg",
    "description": "Durable cables for overhead transmission lines.",
"details": "LRB Overhead Conductors – Connecting Communities, Powering Progress\n\nElectricity is the lifeline of development — and LRB Cables is proud to play a key role in lighting up Bangladesh. Our high-quality Overhead Conductors are specially manufactured to serve urban and rural communities, ensuring safe, efficient, and reliable power transmission.\n\nWe use premium-grade aluminum conductors and virgin PVC components to guarantee long-lasting performance and top-tier safety.\n\nWhy Choose LRB Overhead Conductors?\n\nHigh-conductivity aluminum wires for stable energy flow\n\nDurable, weather-resistant build for outdoor overhead use\n\nManufactured with virgin PVC materials for extra protection\n\nEnsures safe and strong connections across distances\n\nSupports national efforts to enlighten every home and village\n\nFrom city streets to remote villages, LRB Overhead Conductors are helping power dreams and drive development.\n\nLRB Cables – More Than Trust, It’s a Nationwide Connection."
  }
]
